use DBlab2;
--insert data
insert into CUSTOMER (USERNAME,SEX,BYAER,CITY) values(
'赵倩','女',1996,'武汉'),(
'黄超','男',1986,'武汉'),(
'安城','女',1993,'北京'),(
'李源','女',1989,'上海'),(
'赵齐','男',1991,'郑州'),(
'李旺','男',1992,'上海'),(
'陈锋','男',1996,'天津'),(
'陈冕','女',1999,'济南'),(
'黄玲玲','女',1985,'成都'),(
'孙中飞','男',1988,'成都'),(
'钱婷婷','女',1999,'重庆'),(
'李雯','女',2002,'西安');

insert into label (LNAME) values (
'搞笑'),(
'社会'),(
'时尚'),(
'电影'),(
'美女'),(
'体育'),(
'动漫');

insert into MBLOG (TITLE, UID, PYEAR, PMONTH, PDAY, CONT) values(
'校长带全校看复联4', 1, 2019, 4, 26, '复联4上映，校长包场'),(
'生活大爆炸结局', 3, 2019, 4, 25, '生活大爆炸最后一次录制'),(
'风筝', 5, 2019, 4, 20, '竟然有人放航母风筝'),(
'复联4彩蛋', 2, 2019, 4, 24, '复联4没有彩蛋'),(
'复联4剧透', 2, 2019, 4, 24, '灭霸死了'),(
'谢文骏110米跨栏夺冠', 8, 2019, 4, 25, '谢文骏打破记录'),(
'林俊杰圣所', 2, 2019, 4, 26, '要去石家庄了'),(
'邓超盘腿', 1, 2019, 4, 26, '邓超搞笑自拍');

insert into B_L (BID, LID) values (
1, 2),(
1, 4),(
2, 4),(
3, 1),(
4, 4),(
5, 4),(
6, 6),(
7, 1),(
7, 3);

insert into FOLLOW (UID, UIDFLED) values(
1,2),(
1,3),(
1,5),(
2,1),(
2,7),(
3,9),(
3,2),(
4,8),(
5,9),(
6,2);

insert into FRIENDS (UID, FUID) values(
1,2),(
1,3),(
1,4),(
2,1),(
2,3),(
3,5),(
4,1),(
6,5),(
7,5);

insert into thumb (UID, BID) values(
1,3),(
1,2),(
2,7),(
3,6),(
4,6),(
5,6),(
6,1);

insert into sub (UID, LID) values(
1,1),(
1,2),(
1,3),(
1,4),(
1,5),(
1,6),(
1,7),(
2,1),(
3,2);
